In [62]:
import pandas as pd

# write the file name here
df = pd.read_csv('.csv')


df

       company_id                               industry
0        81149246                       Higher Education
1        10033339      Information Technology & Services
2         6049228                             Accounting
3         2641066  Electrical & Electronic Manufacturing
4        96649998                Marketing & Advertising
...           ...                                    ...
15875    74718032                        Food Production
15876       38897                 Hospital & Health Care
15877       38897                 Hospital & Health Care
15878        2623                 Hospital & Health Care
15879       84659                 Hospital & Health Care

[15880 rows x 2 columns]

In [63]:
df = df.dropna()

df

       company_id                               industry
0        81149246                       Higher Education
1        10033339      Information Technology & Services
2         6049228                             Accounting
3         2641066  Electrical & Electronic Manufacturing
4        96649998                Marketing & Advertising
...           ...                                    ...
15875    74718032                        Food Production
15876       38897                 Hospital & Health Care
15877       38897                 Hospital & Health Care
15878        2623                 Hospital & Health Care
15879       84659                 Hospital & Health Care

[15880 rows x 2 columns]

In [64]:
df = df.drop_duplicates()
df

       company_id                               industry
0        81149246                       Higher Education
1        10033339      Information Technology & Services
2         6049228                             Accounting
3         2641066  Electrical & Electronic Manufacturing
4        96649998                Marketing & Advertising
...           ...                                    ...
15866     1839577                             E-learning
15869     1321042                           Construction
15876       38897                 Hospital & Health Care
15878        2623                 Hospital & Health Care
15879       84659                 Hospital & Health Care

[6003 rows x 2 columns]

In [65]:
import os
import datetime as dt
import numpy as np
import unicodedata
import re
from datetime import datetime

In [66]:

def safe_normalize(x):
    if isinstance(x, str):
        return unicodedata.normalize('NFC', x)
    else:
        return str(x)
# write the column names which you want to process (mostly object type, string, text sometimes)
k = ''

In [67]:
df[k] = df[k].apply(safe_normalize)
df[k] = df[k].apply(lambda x: re.sub(r'[^\x00-\x7F]+', '', x))

/var/folders/72/whfc_j3x5t3c93dl5lwxs9m40000gn/T/ipykernel_24878/1401803922.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[k] = df[k].apply(safe_normalize)
/var/folders/72/whfc_j3x5t3c93dl5lwxs9m40000gn/T/ipykernel_24878/1401803922.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[k] = df[k].apply(lambda x: re.sub(r'[^\x00-\x7F]+', '', x))

In [68]:
df.to_csv('comps_ind235.csv', sep=',', index=False, encoding='utf-8')